---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAreUpdatedDueToLevelHeightChange
source: html/9557c6da-bbd6-3d29-a5a9-8a12d61bcf11.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAreUpdatedDueToLevelHeightChange Property

Stair component(s) in the multistory stair are updated due to the level height changes.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsAreUpdatedDueToLevelHeightChange { get; }
```